michelesponchiado/CC2650_fw_update/src/sblAppEx.cpp
/******************************************************************************
*  Filename:       sblAppEx.cpp
*  Revised:        $Date: 2014-10-09 14:34:40 +0200 (to, 09 okt 2014) $
*  Revision:       $Revision: 32696 $
*
*  Description:    Serial Bootloader Library application example.
*                  This example enumerates all COM devices and lets you
*                  select which port to connect to. The example assumes the
*                  connected device is a CC2538 or a CC2650 and programs a blinky
*                  onto the device. After programming the blinky, bootloader
*                  mode may be forced by holding the SELECT button on 06EB
*                  when resetting the chip.
*
*  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/
#ifndef _GNU_SOURCE
	#define _GNU_SOURCE
#endif
#include <stdlib.h>
#include <stdint.h>
#include <sbllib.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <syslog.h>


#include <vector>
#include <iostream>
#include <fstream>


#include <string.h>
#include <stdio.h>
#include <unistd.h>
#include <syslog.h>
#include <stdlib.h>
#include <time.h>
#include <sys/timeb.h>  /* ftime, timeb (for timestamp in millisecond) */
#include <sys/time.h>   /* gettimeofday, timeval (for timestamp in microsecond) */
#include "CC2650_fw_update.h"

#ifdef ANDROID
	#define def_selected_serial_port "/dev/ttymxc2"
#else
	#ifdef OLINUXINO
			#define def_selected_serial_port "/dev/ttyS1"
	#else
			#define def_selected_serial_port "/dev/ttyUSB1"
	#endif
#endif

#ifndef OLINUXINO_LIB
static void open_syslog(void)
{
	openlog("CC2650_fw_upd", LOG_PID|LOG_CONS, LOG_DAEMON);
	syslog(LOG_INFO, "Log just started");
}
#endif

#include <sys/stat.h>
#include <fcntl.h>
static int is_OK_do_CC2650_reset(unsigned int enable_boot_mode)
{
	int is_OK = 1;
#define gpio_base_path "/sys/class/gpio"
#define gpio_export_path gpio_base_path"/export"
#define gpio_value_path gpio_base_path"/value"

	syslog(LOG_INFO, "+%s\n", __func__);
	int fd_reset_low = -1;
	int fd_boot_enable_high = -1;
	char fname_reset[128];
	char fname_boot_enable[128];
	if (snprintf(fname_boot_enable, sizeof(fname_boot_enable), "%s/gpio0/value", gpio_base_path) < 0)
	{
		syslog(LOG_ERR, "ERROR doing snprintf %s\n", fname_boot_enable);
		is_OK = 0;
	}
	else if (snprintf(fname_reset, sizeof(fname_reset), "%s/gpio12/value", gpio_base_path) < 0)
	{
		syslog(LOG_ERR, "ERROR doing snprintf reset %s\n", fname_reset);
		is_OK = 0;
	}
	else
	{
		fd_reset_low = open((char *)fname_reset, O_WRONLY);
		fd_boot_enable_high = open((char *)fname_boot_enable, O_WRONLY);
		if (fd_reset_low < 0)
		{
			syslog(LOG_ERR, "ERROR doing open reset gpio %s", fname_reset);
			is_OK = 0;
		}
		else if (fd_boot_enable_high < 0)
		{
			syslog(LOG_ERR, "ERROR doing open boot enable gpio %s", fname_boot_enable);
			is_OK = 0;
		}
		else
		{
			typedef struct _type_cycle_op
			{
				unsigned int gpio_reset12_boot_0;
				unsigned int value;
				unsigned int delay_ms;
			}type_cycle_op;
			type_cycle_op cycle_op[3];

			// reset low (Active) then wait 100ms
			cycle_op[0].gpio_reset12_boot_0 = 12;
			cycle_op[0].value = 0;
			cycle_op[0].delay_ms = 100;

			// boot enable high (Active)/ low (NOT active) then wait 200ms
			cycle_op[1].gpio_reset12_boot_0 = 0;
			cycle_op[1].value = enable_boot_mode ? 1 : 0;
			cycle_op[1].delay_ms = 200;

			// reset high (NOT Active) then wait 10ms
			cycle_op[2].gpio_reset12_boot_0 = 12;
			cycle_op[2].value = 1;
			cycle_op[2].delay_ms = 10;
#if 0
			// boot enable low (NOT Active) then wait 10ms
			cycle_op[3].gpio_reset12_boot_0 = 0;
			cycle_op[3].value = 0;
			cycle_op[3].delay_ms = 10;
#endif
			unsigned int idx_loop;
			for (idx_loop = 0; is_OK && idx_loop < sizeof(cycle_op)/ sizeof(cycle_op[0]); idx_loop++)
			{
				type_cycle_op * p_cyc = &cycle_op[idx_loop];
				char val[256];
				int n= snprintf(val, sizeof(val), "%u", p_cyc->value);
				if (n > 0)
				{
					int val_len = strlen(val);
					int fd = p_cyc->gpio_reset12_boot_0 == 0 ? fd_boot_enable_high : fd_reset_low;
					int n = write(fd, val, val_len);
					if (n != val_len)
					{
						is_OK = 0;
						syslog(LOG_ERR, "ERROR doing write value %u gpio %u OK", p_cyc->value, p_cyc->gpio_reset12_boot_0);
					}
					else
					{
						syslog(LOG_INFO, "set value %u gpio %u OK", p_cyc->value, p_cyc->gpio_reset12_boot_0);
					}
				}
				else
				{
					is_OK = 0;
					syslog(LOG_ERR, "ERR doing snprintf value %u gpio %u OK", p_cyc->value, p_cyc->gpio_reset12_boot_0);
				}
			}
		}
	}

